blog/purescript-en.org
#+TITLE: Websites with Servant and Purescript/Halogen
#+DATE: 2018-02-21
#+AUTHOR: Colin
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../assets/org-theme.css"/>

* Haskell

[[http://haskell-servant.readthedocs.io/en/stable/][Servant]] is /fantastic/ for writing web servers. The brevity alone makes it my
favourite of all the frameworks I've ever tried in any language. It has a
healthly ecosystem, and in this case, integrates well with Purescript.

This section assumes a ~stack~-based Haskell project and familiarity with
Servant.

** Project Structure

In order for code-sharing with Purescript to work well later, I recommend we
split the backend into three parts, each with their own ~.cabal~ (or ~package.yaml~):

#+BEGIN_SRC yaml
  resolver: lts-10.6  # As of 2018 February

  packages:
    - lib
    - server
    - bridge

  extra-deps:
    - servant-0.12.1
    - servant-server-0.12
    - servant-foreign-0.10.2
#+END_SRC

Our servant ~API~ type and anything else we want to "bridge" to Purescript
is going to live in ~lib~, while the backend logic itself will be in ~server~.

** Code Sharing with Purescript

Two libraries help us:

- ~purescript-bridge~: Generate Purescript types that match given Haskell ones
- ~servant-purescript~: Generate Purescript code to query Servant JSON endpoints

Since ~servant-purescript~ only seems to want to work for JSON endpoints, I have
something like this in the ~lib~ package's ~Common~ module:

#+BEGIN_SRC haskell
  type JsonAPI = "posts" :> Get '[JSON] [Blog]

  type API = JsonAPI
    :<|> "blog" :> Capture "post" Text :> Get '[HTML] (Html ())
    :<|> "assets" :> Raw
    :<|> "webfonts" :> Raw
    :<|> Get '[HTML] (Html ())
#+END_SRC

Where ~JsonAPI~ is all we want to bridge over. The following snippet shows the
contents of our ~bridge~ subpackage:

#+BEGIN_SRC haskell
  {-# LANGUAGE DataKinds, FlexibleContexts #-}

  module Main where

  import Common (Blog, JsonAPI)
  import Language.PureScript.Bridge
  import Servant.PureScript
  import Time.Types

  -- | Generic representations of the Haskell types I want to convert to Purescript.
  -- This generates /new/ Purescript code.
  types :: [SumType 'Haskell]
  types = [ mkSumType (Proxy :: Proxy Blog) ]

  -- | A custom "bridge". Signals that we want to connect a Haskell type to an
  -- existing Purescript type of identical structure. Doesn't generate new code,
  -- just helps with JSON decoding.
  monthBridge :: BridgePart
  monthBridge = typeName ^== "Month" >> pure psMonth

  psMonth :: PSType
  psMonth = TypeInfo { _typePackage    = "purescript-datetime"
                     , _typeModule     = "Data.Date"
                     , _typeName       = "Month"
                     , _typeParameters = [] }

  main :: IO ()
  main = do
    writePSTypes "site/src" (buildBridge $ defaultBridge <|> monthBridge) types
    writeAPIModule "site/src" defaultBridgeProxy (Proxy :: Proxy JsonAPI)
#+END_SRC

~stack exec -- bridge~ will then generate legal Purescript into ~site/src~.
See the Purescript section below for how to interact with this generated code.

