blog/purescript-en.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-02-23 Fri 08:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Websites with Servant and Purescript/Halogen</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Colin" />
<link rel="stylesheet" type="text/css" href="../assets/org-theme.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Websites with Servant and Purescript/Halogen</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge18d3c0">1. Haskell</a>
<ul>
<li><a href="#org317e76d">1.1. Project Structure</a></li>
<li><a href="#org55b8b1c">1.2. Code Sharing with Purescript</a></li>
<li><a href="#org1f70432">1.3. Serving Assets</a>
<ul>
<li><a href="#orgac4c05b">1.3.1. Automatic Gzipping</a></li>
</ul>
</li>
<li><a href="#org656a7d3">1.4. Avoiding Static HTML</a></li>
</ul>
</li>
<li><a href="#orgde60f79">2. Purescript</a>
<ul>
<li><a href="#org23a4a99">2.1. Setup</a>
<ul>
<li><a href="#orgc1a22dc">2.1.1. Tools</a></li>
<li><a href="#org3e91223">2.1.2. Packages</a></li>
<li><a href="#org937d1bd">2.1.3. Spacemacs Integration</a></li>
</ul>
</li>
<li><a href="#org48b0ff0">2.2. Common Commands</a></li>
<li><a href="#org518a5ca">2.3. Halogen</a>
<ul>
<li><a href="#org8fecce4">2.3.1. Avoiding Rerendering</a></li>
<li><a href="#org146eda2">2.3.2. Handling Types Imposed by <code>servant-purescript</code></a></li>
<li><a href="#org8d04e2a">2.3.3. Effectful Component Initialization</a></li>
<li><a href="#org1f5cf32">2.3.4. Requesting and Injecting HTML</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orge18d3c0" class="outline-2">
<h2 id="orge18d3c0"><span class="section-number-2">1</span> Haskell</h2>
<div class="outline-text-2" id="text-1">
<p>
<a href="http://haskell-servant.readthedocs.io/en/stable/">Servant</a> is <i>fantastic</i> for writing web servers. The brevity alone makes it my
favourite of all the frameworks I've ever tried in any language. It has a
healthly ecosystem, and in this case, integrates well with Purescript.
</p>

<p>
This section assumes a <code>stack</code>-based Haskell project and familiarity with
Servant.
</p>
</div>

<div id="outline-container-org317e76d" class="outline-3">
<h3 id="org317e76d"><span class="section-number-3">1.1</span> Project Structure</h3>
<div class="outline-text-3" id="text-1-1">
<p>
In order for code-sharing with Purescript to work well later, I recommend we
split the backend into three parts, each with their own <code>.cabal</code> (or <code>package.yaml</code>):
</p>

<div class="org-src-container">
<pre class="src src-yaml"><span style="color: #715ab1;">resolver</span>: lts-10.6  <span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">As of 2018 February</span>

<span style="color: #715ab1;">packages</span>:
  - lib
  - server
  - bridge

<span style="color: #715ab1;">extra-deps</span>:
  - servant-0.12.1
  - servant-server-0.12
  - servant-foreign-0.10.2
</pre>
</div>

<p>
Our servant <code>API</code> type and anything else we want to "bridge" to Purescript
is going to live in <code>lib</code>, while the backend logic itself will be in <code>server</code>.
</p>
</div>
</div>

<div id="outline-container-org55b8b1c" class="outline-3">
<h3 id="org55b8b1c"><span class="section-number-3">1.2</span> Code Sharing with Purescript</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Two libraries help us:
</p>

<ul class="org-ul">
<li><code>purescript-bridge</code>: Generate Purescript types that match given Haskell ones</li>
<li><code>servant-purescript</code>: Generate Purescript code to query Servant JSON endpoints</li>
</ul>

<p>
Since <code>servant-purescript</code> only seems to want to work for JSON endpoints, I have
something like this in the <code>lib</code> package's <code>Common</code> module:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #3a81c3; font-weight: bold;">type</span> <span style="color: #ba2f59; font-weight: bold;">JsonAPI</span> <span style="color: #715ab1;">=</span> <span style="color: #2d9574;">"posts"</span> <span style="color: #ba2f59; font-weight: bold;">:&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Get</span> '<span style="color: #3a81c3;">[</span><span style="color: #ba2f59; font-weight: bold;">JSON</span><span style="color: #3a81c3;">]</span> <span style="color: #3a81c3;">[</span><span style="color: #ba2f59; font-weight: bold;">Blog</span><span style="color: #3a81c3;">]</span>

<span style="color: #3a81c3; font-weight: bold;">type</span> <span style="color: #ba2f59; font-weight: bold;">API</span> <span style="color: #715ab1;">=</span> <span style="color: #ba2f59; font-weight: bold;">JsonAPI</span>
  <span style="color: #ba2f59; font-weight: bold;">:&lt;|&gt;</span> <span style="color: #2d9574;">"blog"</span> <span style="color: #ba2f59; font-weight: bold;">:&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Capture</span> <span style="color: #2d9574;">"post"</span> <span style="color: #ba2f59; font-weight: bold;">Text</span> <span style="color: #ba2f59; font-weight: bold;">:&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Get</span> '<span style="color: #3a81c3;">[</span><span style="color: #ba2f59; font-weight: bold;">HTML</span><span style="color: #3a81c3;">]</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Html</span> <span style="color: #6c3163; font-weight: bold;">()</span><span style="color: #3a81c3;">)</span>
  <span style="color: #ba2f59; font-weight: bold;">:&lt;|&gt;</span> <span style="color: #2d9574;">"assets"</span> <span style="color: #ba2f59; font-weight: bold;">:&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Raw</span>
  <span style="color: #ba2f59; font-weight: bold;">:&lt;|&gt;</span> <span style="color: #2d9574;">"webfonts"</span> <span style="color: #ba2f59; font-weight: bold;">:&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Raw</span>
  <span style="color: #ba2f59; font-weight: bold;">:&lt;|&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Get</span> '<span style="color: #3a81c3;">[</span><span style="color: #ba2f59; font-weight: bold;">HTML</span><span style="color: #3a81c3;">]</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Html</span> <span style="color: #6c3163; font-weight: bold;">()</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
Where <code>JsonAPI</code> is all we want to bridge over. The following snippet shows the
contents of our <code>bridge</code> subpackage:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #6c3163;">{-# LANGUAGE DataKinds, FlexibleContexts #-}</span>

<span style="color: #3a81c3; font-weight: bold;">module</span> <span style="color: #ba2f59; font-weight: bold;">Main</span> <span style="color: #3a81c3; font-weight: bold;">where</span>

<span style="color: #3a81c3; font-weight: bold;">import</span> <span style="color: #ba2f59; font-weight: bold;">Common</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Blog</span>, <span style="color: #ba2f59; font-weight: bold;">JsonAPI</span><span style="color: #3a81c3;">)</span>
<span style="color: #3a81c3; font-weight: bold;">import</span> <span style="color: #ba2f59; font-weight: bold;">Language.PureScript.Bridge</span>
<span style="color: #3a81c3; font-weight: bold;">import</span> <span style="color: #ba2f59; font-weight: bold;">Servant.PureScript</span>
<span style="color: #3a81c3; font-weight: bold;">import</span> <span style="color: #ba2f59; font-weight: bold;">Time.Types</span>

<span style="color: #da8b55;">-- | Generic representations of the Haskell types I want to convert to Purescript.</span>
<span style="color: #da8b55;">-- This generates </span><span style="color: #da8b55; font-style: italic;">/new/</span><span style="color: #da8b55;"> Purescript code.</span>
<span style="color: #6c3163; font-weight: bold;">types</span> <span style="color: #715ab1;">::</span> <span style="color: #3a81c3;">[</span><span style="color: #ba2f59; font-weight: bold;">SumType</span> '<span style="color: #ba2f59; font-weight: bold;">Haskell</span><span style="color: #3a81c3;">]</span>
<span style="color: #6c3163; font-weight: bold;">types</span> <span style="color: #715ab1;">=</span> <span style="color: #3a81c3;">[</span> mkSumType <span style="color: #6c3163;">(</span><span style="color: #ba2f59; font-weight: bold;">Proxy</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Proxy</span> <span style="color: #ba2f59; font-weight: bold;">Blog</span><span style="color: #6c3163;">)</span> <span style="color: #3a81c3;">]</span>

<span style="color: #da8b55;">-- | A custom "bridge". Signals that we want to connect a Haskell type to an</span>
<span style="color: #da8b55;">-- existing Purescript type of identical structure. Doesn't generate new code,</span>
<span style="color: #da8b55;">-- just helps with JSON decoding.</span>
<span style="color: #6c3163; font-weight: bold;">monthBridge</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">BridgePart</span>
<span style="color: #6c3163; font-weight: bold;">monthBridge</span> <span style="color: #715ab1;">=</span> typeName <span style="color: #715ab1;">^==</span> <span style="color: #2d9574;">"Month"</span> <span style="color: #715ab1;">&gt;&gt;</span> pure psMonth

<span style="color: #6c3163; font-weight: bold;">psMonth</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">PSType</span>
<span style="color: #6c3163; font-weight: bold;">psMonth</span> <span style="color: #715ab1;">=</span> <span style="color: #ba2f59; font-weight: bold;">TypeInfo</span> <span style="color: #3a81c3;">{</span> _typePackage    <span style="color: #715ab1;">=</span> <span style="color: #2d9574;">"purescript-datetime"</span>
                   , _typeModule     <span style="color: #715ab1;">=</span> <span style="color: #2d9574;">"Data.Date"</span>
                   , _typeName       <span style="color: #715ab1;">=</span> <span style="color: #2d9574;">"Month"</span>
                   , _typeParameters <span style="color: #715ab1;">=</span> <span style="color: #6c3163; font-weight: bold;">[]</span> <span style="color: #3a81c3;">}</span>

<span style="color: #6c3163; font-weight: bold;">main</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">IO</span> <span style="color: #3a81c3; font-weight: bold;">()</span>
<span style="color: #6c3163; font-weight: bold;">main</span> <span style="color: #715ab1;">=</span> <span style="color: #3a81c3; font-weight: bold;">do</span>
  writePSTypes <span style="color: #2d9574;">"site/src"</span> <span style="color: #3a81c3;">(</span>buildBridge <span style="color: #715ab1;">$</span> defaultBridge <span style="color: #715ab1;">&lt;|&gt;</span> monthBridge<span style="color: #3a81c3;">)</span> types
  writeAPIModule <span style="color: #2d9574;">"site/src"</span> defaultBridgeProxy <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Proxy</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Proxy</span> <span style="color: #ba2f59; font-weight: bold;">JsonAPI</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
<code>stack exec -- bridge</code> will then generate legal Purescript into <code>site/src</code>.
See the Purescript section below for how to interact with this generated code.
</p>
</div>
</div>
