blog/purescript-en.org
** Serving Assets

"Just serve any file from the directory I indicate." Easy:

#+BEGIN_SRC haskell
  import Servant.Utils.StaticFiles (serveDirectoryFileServer)

  type API = ... :<|> "assets" :> Raw

  server :: Server API
  server = ... :<|> serveDirectoryFileServer "assets"
#+END_SRC

All of our ~.js~ and ~.css~ files can live in ~assets/~ now.

*** Automatic Gzipping

This greatly reduces the size of assets being transfered to the user, for
very little effort on our part. Via the [[https://hackage.haskell.org/package/wai-extra][wai-extra]] library:

#+BEGIN_SRC haskell
  import Network.Wai.Middleware.Gzip

  app :: Application
  app = gzip (def { gzipFiles = GzipCompress }) $ serve (Proxy :: Proxy API) server
  -- Previously:
  --   app = serve (Proxy :: Proxy API) server
#+END_SRC

** Avoiding Static HTML

Since Purescript is generating our UI, we don't actually need to commit any HTML files.
Our ~index.html~ can also be produced on-the-fly by our backend:

#+BEGIN_SRC haskell
  import Lucid
  import Servant.HTML.Lucid

  -- | The final `Get` here will match on `/`, the site's root.
  type API = ... :<|> Get '[HTML] (Html ())

  index :: Html ()
  index = html_ $ head_ h *> body_ (script_ [src_ "assets/app.js"] ("" :: Text))
    where h = do
            title_ "fosskers.ca"
            link_ [ rel_ "stylesheet", href_ "assets/fosskers.css" ]

  server :: Server API
  server = ... :<|> pure index
#+END_SRC

* Purescript

** Setup

This requires [[https://www.npmjs.com/][npm]] to be installed.

*** Tools

The canonical dev environment for Purescript requires some use of ~npm~.
First we generate a ~package.json~, our "project level" config:

#+BEGIN_SRC bash
  npm init
#+END_SRC

Next we install some tools.
I'm usually hesitant when it comes to installing packages outside the purview
of my system's package manager, but the following will install all the tools
we need into a project-local ~node-modules/~ directory:

#+BEGIN_SRC bash
  npm install purescript pulp psc-package pscid purescript-psa uglify-js --save-dev
#+END_SRC

- ~purescript~: The compiler
- ~pulp~: The canonical build tool
- ~psc-package~: The package manager for Purescript libraries
- ~pscid~: A compilation daemon, similar to ~stack build --file-watch~
- ~purescript-psa~: Used by ~pulp~ to display nicer compiler errors
- ~uglify-js~: For minimizing our final "production bundle"

We'll notice these appear as dependency entries in our ~package.json~.

~npm~ also lets us define project-local commands to use the tools we just installed.
Here are some useful ones we can enter into ~package.json~:

#+BEGIN_SRC js
  ...
  "scripts": {
      "pulp": "pulp --psc-package",
      "pscid": "pscid",
      "psc": "psc-package",
      "uglify": "uglifyjs"
  },
  ...
#+END_SRC

*** Packages

Now, to generate some more scaffolding:

#+BEGIN_SRC bash
  npm run pulp init
#+END_SRC

This produces:

- ~psc-package.json~: Where we define library dependencies
- ~src/Main.purs~
- ~test/Main.purs~

We can check [[https://pursuit.purescript.org/][Pursuit]] for the list of available PureScript libraries, and install
them with:

#+BEGIN_SRC bash
  # Install the package `purescript-halogen`.
  # Notice that the `purescript-` is left off here.
  npm run psc -- install halogen
#+END_SRC

This will install the version of ~halogen~ that's pinned in the [[https://github.com/purescript/package-sets][psc package set]] we're using.
If the installation was successful, we'll notice ~halogen~ appear in our ~psc-package.json~.

