blog/purescript-en.html

<div id="outline-container-org1f70432" class="outline-3">
<h3 id="org1f70432"><span class="section-number-3">1.3</span> Serving Assets</h3>
<div class="outline-text-3" id="text-1-3">
<p>
"Just serve any file from the directory I indicate." Easy:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #3a81c3; font-weight: bold;">import</span> <span style="color: #ba2f59; font-weight: bold;">Servant.Utils.StaticFiles</span> <span style="color: #3a81c3;">(</span>serveDirectoryFileServer<span style="color: #3a81c3;">)</span>

<span style="color: #3a81c3; font-weight: bold;">type</span> <span style="color: #ba2f59; font-weight: bold;">API</span> <span style="color: #715ab1;">=</span> <span style="color: #715ab1;">...</span> <span style="color: #ba2f59; font-weight: bold;">:&lt;|&gt;</span> <span style="color: #2d9574;">"assets"</span> <span style="color: #ba2f59; font-weight: bold;">:&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Raw</span>

<span style="color: #6c3163; font-weight: bold;">server</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Server</span> <span style="color: #ba2f59; font-weight: bold;">API</span>
<span style="color: #6c3163; font-weight: bold;">server</span> <span style="color: #715ab1;">=</span> <span style="color: #715ab1;">...</span> <span style="color: #ba2f59; font-weight: bold;">:&lt;|&gt;</span> serveDirectoryFileServer <span style="color: #2d9574;">"assets"</span>
</pre>
</div>

<p>
All of our <code>.js</code> and <code>.css</code> files can live in <code>assets/</code> now.
</p>
</div>

<div id="outline-container-orgac4c05b" class="outline-4">
<h4 id="orgac4c05b"><span class="section-number-4">1.3.1</span> Automatic Gzipping</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
This greatly reduces the size of assets being transfered to the user, for
very little effort on our part. Via the <a href="https://hackage.haskell.org/package/wai-extra">wai-extra</a> library:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #3a81c3; font-weight: bold;">import</span> <span style="color: #ba2f59; font-weight: bold;">Network.Wai.Middleware.Gzip</span>

<span style="color: #6c3163; font-weight: bold;">app</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Application</span>
<span style="color: #6c3163; font-weight: bold;">app</span> <span style="color: #715ab1;">=</span> gzip <span style="color: #3a81c3;">(</span>def <span style="color: #6c3163;">{</span> gzipFiles <span style="color: #715ab1;">=</span> <span style="color: #ba2f59; font-weight: bold;">GzipCompress</span> <span style="color: #6c3163;">}</span><span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">$</span> serve <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Proxy</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Proxy</span> <span style="color: #ba2f59; font-weight: bold;">API</span><span style="color: #3a81c3;">)</span> server
<span style="color: #2aa1ae; background-color: #ecf3ec;">-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Previously:</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;">--   </span><span style="color: #2aa1ae; background-color: #ecf3ec;">app = serve (Proxy :: Proxy API) server</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org656a7d3" class="outline-3">
<h3 id="org656a7d3"><span class="section-number-3">1.4</span> Avoiding Static HTML</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Since Purescript is generating our UI, we don't actually need to commit any HTML files.
Our <code>index.html</code> can also be produced on-the-fly by our backend:
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #3a81c3; font-weight: bold;">import</span> <span style="color: #ba2f59; font-weight: bold;">Lucid</span>
<span style="color: #3a81c3; font-weight: bold;">import</span> <span style="color: #ba2f59; font-weight: bold;">Servant.HTML.Lucid</span>

<span style="color: #da8b55;">-- | The final `Get` here will match on `/`, the site's root.</span>
<span style="color: #3a81c3; font-weight: bold;">type</span> <span style="color: #ba2f59; font-weight: bold;">API</span> <span style="color: #715ab1;">=</span> <span style="color: #715ab1;">...</span> <span style="color: #ba2f59; font-weight: bold;">:&lt;|&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Get</span> '<span style="color: #3a81c3;">[</span><span style="color: #ba2f59; font-weight: bold;">HTML</span><span style="color: #3a81c3;">]</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Html</span> <span style="color: #6c3163; font-weight: bold;">()</span><span style="color: #3a81c3;">)</span>

<span style="color: #6c3163; font-weight: bold;">index</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Html</span> <span style="color: #3a81c3; font-weight: bold;">()</span>
<span style="color: #6c3163; font-weight: bold;">index</span> <span style="color: #715ab1;">=</span> html_ <span style="color: #715ab1;">$</span> head_ h <span style="color: #715ab1;">*&gt;</span> body_ <span style="color: #3a81c3;">(</span>script_ <span style="color: #6c3163;">[</span>src_ <span style="color: #2d9574;">"assets/app.js"</span><span style="color: #6c3163;">]</span> <span style="color: #6c3163;">(</span><span style="color: #2d9574;">""</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Text</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>
  <span style="color: #3a81c3; font-weight: bold;">where</span> h <span style="color: #715ab1;">=</span> <span style="color: #3a81c3; font-weight: bold;">do</span>
          title_ <span style="color: #2d9574;">"fosskers.ca"</span>
          link_ <span style="color: #3a81c3;">[</span> rel_ <span style="color: #2d9574;">"stylesheet"</span>, href_ <span style="color: #2d9574;">"assets/fosskers.css"</span> <span style="color: #3a81c3;">]</span>

<span style="color: #6c3163; font-weight: bold;">server</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Server</span> <span style="color: #ba2f59; font-weight: bold;">API</span>
<span style="color: #6c3163; font-weight: bold;">server</span> <span style="color: #715ab1;">=</span> <span style="color: #715ab1;">...</span> <span style="color: #ba2f59; font-weight: bold;">:&lt;|&gt;</span> pure index
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgde60f79" class="outline-2">
<h2 id="orgde60f79"><span class="section-number-2">2</span> Purescript</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org23a4a99" class="outline-3">
<h3 id="org23a4a99"><span class="section-number-3">2.1</span> Setup</h3>
<div class="outline-text-3" id="text-2-1">
<p>
This requires <a href="https://www.npmjs.com/">npm</a> to be installed.
</p>
</div>

<div id="outline-container-orgc1a22dc" class="outline-4">
<h4 id="orgc1a22dc"><span class="section-number-4">2.1.1</span> Tools</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
The canonical dev environment for Purescript requires some use of <code>npm</code>.
First we generate a <code>package.json</code>, our "project level" config:
</p>

<div class="org-src-container">
<pre class="src src-bash">npm init
</pre>
</div>

<p>
Next we install some tools.
I'm usually hesitant when it comes to installing packages outside the purview
of my system's package manager, but the following will install all the tools
we need into a project-local <code>node-modules/</code> directory:
</p>

<div class="org-src-container">
<pre class="src src-bash">npm install purescript pulp psc-package pscid purescript-psa uglify-js --save-dev
</pre>
</div>

<ul class="org-ul">
<li><code>purescript</code>: The compiler</li>
<li><code>pulp</code>: The canonical build tool</li>
<li><code>psc-package</code>: The package manager for Purescript libraries</li>
<li><code>pscid</code>: A compilation daemon, similar to <code>stack build --file-watch</code></li>
<li><code>purescript-psa</code>: Used by <code>pulp</code> to display nicer compiler errors</li>
<li><code>uglify-js</code>: For minimizing our final "production bundle"</li>
</ul>

<p>
We'll notice these appear as dependency entries in our <code>package.json</code>.
</p>

<p>
<code>npm</code> also lets us define project-local commands to use the tools we just installed.
Here are some useful ones we can enter into <code>package.json</code>:
</p>

<div class="org-src-container">
<pre class="src src-js">...
<span style="color: #2d9574;">"scripts"</span>: <span style="color: #3a81c3;">{</span>
    <span style="color: #2d9574;">"pulp"</span>: <span style="color: #2d9574;">"pulp --psc-package"</span>,
    <span style="color: #2d9574;">"pscid"</span>: <span style="color: #2d9574;">"pscid"</span>,
    <span style="color: #2d9574;">"psc"</span>: <span style="color: #2d9574;">"psc-package"</span>,
    <span style="color: #2d9574;">"uglify"</span>: <span style="color: #2d9574;">"uglifyjs"</span>
<span style="color: #3a81c3;">}</span>,
...
</pre>
</div>
</div>
</div>

<div id="outline-container-org3e91223" class="outline-4">
<h4 id="org3e91223"><span class="section-number-4">2.1.2</span> Packages</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
Now, to generate some more scaffolding:
</p>

<div class="org-src-container">
<pre class="src src-bash">npm run pulp init
</pre>
</div>

<p>
This produces:
</p>

<ul class="org-ul">
<li><code>psc-package.json</code>: Where we define library dependencies</li>
<li><code>src/Main.purs</code></li>
<li><code>test/Main.purs</code></li>
</ul>

<p>
We can check <a href="https://pursuit.purescript.org/">Pursuit</a> for the list of available PureScript libraries, and install
them with:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Install the package `purescript-halogen`.</span>
<span style="color: #2aa1ae; background-color: #ecf3ec;"># </span><span style="color: #2aa1ae; background-color: #ecf3ec;">Notice that the `purescript-` is left off here.</span>
npm run psc -- install halogen
</pre>
</div>

<p>
This will install the version of <code>halogen</code> that's pinned in the <a href="https://github.com/purescript/package-sets">psc package set</a> we're using.
If the installation was successful, we'll notice <code>halogen</code> appear in our <code>psc-package.json</code>.
</p>
</div>
</div>
