blog/purescript-en.org
*** Spacemacs Integration

The [[http://spacemacs.org/layers/+lang/purescript/README.html][Purescript Layer]] works quite nicely out of the box. In order for Spacemacs
to detect our npm-installed tools, we configure our Purescript layer like so:

#+BEGIN_SRC lisp
  (purescript :variables psc-ide-use-npm-bin t)
#+END_SRC

I also found it necessary to add the following to ~dotspacemacs/user-config~:

#+BEGIN_SRC lisp
  (add-hook 'purescript-mode-hook 'flycheck-mode)
#+END_SRC

Handy Keybindings:

| Keys          | Effect                                                             |
|---------------+--------------------------------------------------------------------|
| ~SPC m m s~   | Start a ~pscid~ session (enables auto-completion and auto-imports) |
| ~SPC m m i a~ | Import the symbol at ~point~                                       |

** Common Commands

To (re)download all tool dependencies marked in ~package.json~:

#+BEGIN_SRC bash
  npm install
#+END_SRC

To (re)download all library dependencies marked in ~psc-package.json~:

#+BEGIN_SRC bash
  npm run psc -- update
#+END_SRC

To compile all library dependencies and our code into CommonJS-compatible Javascript:

#+BEGIN_SRC bash
  npm run pulp build
#+END_SRC

To bundle only what's needed into a single ~.js~ file:

#+BEGIN_SRC bash
  npm run pulp -- build --to app.js
#+END_SRC

To run the ~pscid~ daemon:

#+BEGIN_SRC bash
  npm run pscid
#+END_SRC

To run our test suites:

#+BEGIN_SRC bash
  npm run pulp test
#+END_SRC

To minify our bundled Javascript:

#+BEGIN_SRC bash
  npm run uglify -- app.js --output min.js --compress --mangle
#+END_SRC

The behaviour of the minified code seems to be the same, and the file size
is less than half of the original human-readable code.


** Halogen

Before writing anything, I read the [[https://github.com/slamdata/purescript-halogen/tree/master/docs][official Halogen guide]] and found it quite good.
It equipped me with 95% of what I needed to know to be productive, having written no
Purescript before. The rest I gained by reading about [[https://github.com/purescript/documentation/blob/master/language/Differences-from-Haskell.md][the differences between Purescript and Haskell]]
and through experimentation, the fruits of which I explain below.

*** Avoiding Rerendering

Every time ~H.put~ or ~H.modify~ is called in our ~eval~ function, the
component will be rerendered. Here's a helper function that will only
update a part of our state if it has actually changed:

#+BEGIN_SRC purescript
  -- | Updates some State only if it's changed.
  update :: forall s a m. MonadState s m => Eq a => Lens' s a -> a -> m Unit
  update l a = do
    curr <- gets (_ ^. l)
    unless (a == curr) $ modify (_ # l .~ a)
#+END_SRC

Example of usage:

#+BEGIN_SRC purescript
  eval = case _ do
    NewKeywords kws next -> update (prop (SProxy :: SProxy "keywords")) kws *> pure next
    ...  -- more cases here
#+END_SRC

~prop~, when given a record field name, yields a ~Lens~ into that field.

