blog/purescript-en.html

<div id="outline-container-org937d1bd" class="outline-4">
<h4 id="org937d1bd"><span class="section-number-4">2.1.3</span> Spacemacs Integration</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
The <a href="http://spacemacs.org/layers/+lang/purescript/README.html">Purescript Layer</a> works quite nicely out of the box. In order for Spacemacs
to detect our npm-installed tools, we configure our Purescript layer like so:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span>purescript <span style="color: #3a81c3;">:variables</span> psc-ide-use-npm-bin t<span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
I also found it necessary to add the following to <code>dotspacemacs/user-config</code>:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span style="color: #3a81c3;">(</span>add-hook 'purescript-mode-hook 'flycheck-mode<span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
Handy Keybindings:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keys</th>
<th scope="col" class="org-left">Effect</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>SPC m m s</code></td>
<td class="org-left">Start a <code>pscid</code> session (enables auto-completion and auto-imports)</td>
</tr>

<tr>
<td class="org-left"><code>SPC m m i a</code></td>
<td class="org-left">Import the symbol at <code>point</code></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-org48b0ff0" class="outline-3">
<h3 id="org48b0ff0"><span class="section-number-3">2.2</span> Common Commands</h3>
<div class="outline-text-3" id="text-2-2">
<p>
To (re)download all tool dependencies marked in <code>package.json</code>:
</p>

<div class="org-src-container">
<pre class="src src-bash">npm install
</pre>
</div>

<p>
To (re)download all library dependencies marked in <code>psc-package.json</code>:
</p>

<div class="org-src-container">
<pre class="src src-bash">npm run psc -- update
</pre>
</div>

<p>
To compile all library dependencies and our code into CommonJS-compatible Javascript:
</p>

<div class="org-src-container">
<pre class="src src-bash">npm run pulp build
</pre>
</div>

<p>
To bundle only what's needed into a single <code>.js</code> file:
</p>

<div class="org-src-container">
<pre class="src src-bash">npm run pulp -- build --to app.js
</pre>
</div>

<p>
To run the <code>pscid</code> daemon:
</p>

<div class="org-src-container">
<pre class="src src-bash">npm run pscid
</pre>
</div>

<p>
To run our test suites:
</p>

<div class="org-src-container">
<pre class="src src-bash">npm run pulp test
</pre>
</div>

<p>
To minify our bundled Javascript:
</p>

<div class="org-src-container">
<pre class="src src-bash">npm run uglify -- app.js --output min.js --compress --mangle
</pre>
</div>

<p>
The behaviour of the minified code seems to be the same, and the file size
is less than half of the original human-readable code.
</p>
</div>
</div>


<div id="outline-container-org518a5ca" class="outline-3">
<h3 id="org518a5ca"><span class="section-number-3">2.3</span> Halogen</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Before writing anything, I read the <a href="https://github.com/slamdata/purescript-halogen/tree/master/docs">official Halogen guide</a> and found it quite good.
It equipped me with 95% of what I needed to know to be productive, having written no
Purescript before. The rest I gained by reading about <a href="https://github.com/purescript/documentation/blob/master/language/Differences-from-Haskell.md">the differences between Purescript and Haskell</a>
and through experimentation, the fruits of which I explain below.
</p>
</div>

<div id="outline-container-org8fecce4" class="outline-4">
<h4 id="org8fecce4"><span class="section-number-4">2.3.1</span> Avoiding Rerendering</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
Every time <code>H.put</code> or <code>H.modify</code> is called in our <code>eval</code> function, the
component will be rerendered. Here's a helper function that will only
update a part of our state if it has actually changed:
</p>

<div class="org-src-container">
<pre class="src src-purescript"><span style="color: #da8b55;">-- | Updates some State only if it's changed.</span>
<span style="color: #6c3163; font-weight: bold;">update</span> <span style="color: #715ab1;">::</span> forall s a m<span style="color: #715ab1;">.</span> <span style="color: #ba2f59; font-weight: bold;">MonadState</span> s m <span style="color: #715ab1;">=&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Eq</span> a <span style="color: #715ab1;">=&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Lens'</span> s a <span style="color: #715ab1;">-&gt;</span> a <span style="color: #715ab1;">-&gt;</span> m <span style="color: #ba2f59; font-weight: bold;">Unit</span>
<span style="color: #6c3163; font-weight: bold;">update</span> l a <span style="color: #715ab1;">=</span> <span style="color: #3a81c3; font-weight: bold;">do</span>
  curr <span style="color: #715ab1;">&lt;-</span> gets <span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">_</span> <span style="color: #715ab1;">^.</span> l<span style="color: #3a81c3;">)</span>
  unless <span style="color: #3a81c3;">(</span>a <span style="color: #715ab1;">==</span> curr<span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">$</span> modify <span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">_</span> <span style="color: #715ab1;">#</span> l <span style="color: #715ab1;">.~</span> a<span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
Example of usage:
</p>

<div class="org-src-container">
<pre class="src src-purescript"><span style="color: #6c3163; font-weight: bold;">eval</span> <span style="color: #715ab1;">=</span> <span style="color: #3a81c3; font-weight: bold;">case</span> <span style="color: #3a81c3; font-weight: bold;">_</span> <span style="color: #3a81c3; font-weight: bold;">do</span>
  <span style="color: #ba2f59; font-weight: bold;">NewKeywords</span> kws next <span style="color: #715ab1;">-&gt;</span> update <span style="color: #3a81c3;">(</span>prop <span style="color: #6c3163;">(</span><span style="color: #ba2f59; font-weight: bold;">SProxy</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">SProxy</span> <span style="color: #2d9574;">"keywords"</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span> kws <span style="color: #715ab1;">*&gt;</span> pure next
  <span style="color: #715ab1;">...</span>  <span style="color: #2aa1ae; background-color: #ecf3ec;">-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">more cases here</span>
</pre>
</div>

<p>
<code>prop</code>, when given a record field name, yields a <code>Lens</code> into that field.
</p>
</div>
</div>
