blog/purescript-en.org
*** Handling Types Imposed by ~servant-purescript~

To query the endpoint ~type JsonAPI = "posts" :> Get '[JSON] [Blog]~, ~servant-purescript~
spat out:

#+BEGIN_SRC purescript
  getPosts :: forall eff m.
              MonadAsk (SPSettings_ SPParams_) m =>
              MonadError AjaxError m =>
              MonadAff ( ajax :: AJAX | eff ) m
              => m (Array Blog)
#+END_SRC

Simple Halogen components leave their effect Monad parameter as ~m~ on functions
like ~eval~. However, if we want to call ~getPosts~ at any point, its constraints
will pervasively spread across our components. To avoid giant type signatures
and lots of repeated imports, I added the following to a central ~Types.purs~ module:

#+BEGIN_SRC purescript
  type Effects eff = ReaderT (SPSettings_ SPParams_)
                     (ExceptT AjaxError (Aff (ajax :: AJAX, console :: CONSOLE, dom :: DOM | eff)))

  runEffects :: forall eff. Effects eff ~> Aff (ajax :: AJAX, console :: CONSOLE, dom :: DOM | eff)
  runEffects eff = runExceptT (runReaderT eff settings) >>= either (\e -> log (errorToString e) *> empty) pure

  settings :: SPSettings_ SPParams_
  settings = defaultSettings $ SPParams_ { baseURL: "/" }
#+END_SRC

Which simplifies type signatures to things like:

#+BEGIN_SRC purescript
  component :: forall e. H.Component HH.HTML Query Unit Void (Effects e)
#+END_SRC

Our ~main~ then only requires a little bit of massaging via ~hoist~:

#+BEGIN_SRC purescript
  import Halogen.Aff as HA
  import Halogen.Component as HC

  main :: Eff (HA.HalogenEffects (ajax :: AJAX, console :: CONSOLE)) Unit
  main = HA.runHalogenAff do
    body <- HA.awaitBody
    runUI (HC.hoist runEffects Page.component) unit body
#+END_SRC

