blog/purescript-en.html

<div id="outline-container-org146eda2" class="outline-4">
<h4 id="org146eda2"><span class="section-number-4">2.3.2</span> Handling Types Imposed by <code>servant-purescript</code></h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
To query the endpoint <code>type JsonAPI = "posts" :&gt; Get '[JSON] [Blog]</code>, <code>servant-purescript</code>
spat out:
</p>

<div class="org-src-container">
<pre class="src src-purescript"><span style="color: #6c3163; font-weight: bold;">getPosts</span> <span style="color: #715ab1;">::</span> forall eff m<span style="color: #715ab1;">.</span>
            <span style="color: #ba2f59; font-weight: bold;">MonadAsk</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">SPSettings_</span> <span style="color: #ba2f59; font-weight: bold;">SPParams_</span><span style="color: #3a81c3;">)</span> m <span style="color: #715ab1;">=&gt;</span>
            <span style="color: #ba2f59; font-weight: bold;">MonadError</span> <span style="color: #ba2f59; font-weight: bold;">AjaxError</span> m <span style="color: #715ab1;">=&gt;</span>
            <span style="color: #ba2f59; font-weight: bold;">MonadAff</span> <span style="color: #3a81c3;">(</span> ajax <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">AJAX</span> <span style="color: #715ab1;">|</span> eff <span style="color: #3a81c3;">)</span> m
            <span style="color: #715ab1;">=&gt;</span> m <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Array</span> <span style="color: #ba2f59; font-weight: bold;">Blog</span><span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
Simple Halogen components leave their effect Monad parameter as <code>m</code> on functions
like <code>eval</code>. However, if we want to call <code>getPosts</code> at any point, its constraints
will pervasively spread across our components. To avoid giant type signatures
and lots of repeated imports, I added the following to a central <code>Types.purs</code> module:
</p>

<div class="org-src-container">
<pre class="src src-purescript"><span style="color: #3a81c3; font-weight: bold;">type</span> <span style="color: #ba2f59; font-weight: bold;">Effects</span> eff <span style="color: #715ab1;">=</span> <span style="color: #ba2f59; font-weight: bold;">ReaderT</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">SPSettings_</span> <span style="color: #ba2f59; font-weight: bold;">SPParams_</span><span style="color: #3a81c3;">)</span>
                   <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">ExceptT</span> <span style="color: #ba2f59; font-weight: bold;">AjaxError</span> <span style="color: #6c3163;">(</span><span style="color: #ba2f59; font-weight: bold;">Aff</span> <span style="color: #2d9574;">(</span>ajax <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">AJAX</span>, console <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">CONSOLE</span>, dom <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">DOM</span> <span style="color: #715ab1;">|</span> eff<span style="color: #2d9574;">)</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span>

<span style="color: #6c3163; font-weight: bold;">runEffects</span> <span style="color: #715ab1;">::</span> forall eff<span style="color: #715ab1;">.</span> <span style="color: #ba2f59; font-weight: bold;">Effects</span> eff <span style="color: #715ab1;">~&gt;</span> <span style="color: #ba2f59; font-weight: bold;">Aff</span> <span style="color: #3a81c3;">(</span>ajax <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">AJAX</span>, console <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">CONSOLE</span>, dom <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">DOM</span> <span style="color: #715ab1;">|</span> eff<span style="color: #3a81c3;">)</span>
<span style="color: #6c3163; font-weight: bold;">runEffects</span> eff <span style="color: #715ab1;">=</span> runExceptT <span style="color: #3a81c3;">(</span>runReaderT eff settings<span style="color: #3a81c3;">)</span> <span style="color: #715ab1;">&gt;&gt;=</span> either <span style="color: #3a81c3;">(</span><span style="color: #715ab1;">\</span>e <span style="color: #715ab1;">-&gt;</span> log <span style="color: #6c3163;">(</span>errorToString e<span style="color: #6c3163;">)</span> <span style="color: #715ab1;">*&gt;</span> empty<span style="color: #3a81c3;">)</span> pure

<span style="color: #6c3163; font-weight: bold;">settings</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">SPSettings_</span> <span style="color: #ba2f59; font-weight: bold;">SPParams_</span>
<span style="color: #6c3163; font-weight: bold;">settings</span> <span style="color: #715ab1;">=</span> defaultSettings <span style="color: #715ab1;">$</span> <span style="color: #ba2f59; font-weight: bold;">SPParams_</span> <span style="color: #3a81c3;">{</span> baseURL<span style="color: #ba2f59; font-weight: bold;">:</span> <span style="color: #2d9574;">"/"</span> <span style="color: #3a81c3;">}</span>
</pre>
</div>

<p>
Which simplifies type signatures to things like:
</p>

<div class="org-src-container">
<pre class="src src-purescript"><span style="color: #6c3163; font-weight: bold;">component</span> <span style="color: #715ab1;">::</span> forall e<span style="color: #715ab1;">.</span> <span style="color: #ba2f59; font-weight: bold;">H.Component</span> <span style="color: #ba2f59; font-weight: bold;">HH.HTML</span> <span style="color: #ba2f59; font-weight: bold;">Query</span> <span style="color: #ba2f59; font-weight: bold;">Unit</span> <span style="color: #ba2f59; font-weight: bold;">Void</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Effects</span> e<span style="color: #3a81c3;">)</span>
</pre>
</div>

<p>
Our <code>main</code> then only requires a little bit of massaging via <code>hoist</code>:
</p>

<div class="org-src-container">
<pre class="src src-purescript"><span style="color: #3a81c3; font-weight: bold;">import</span> <span style="color: #ba2f59; font-weight: bold;">Halogen.Aff</span> <span style="color: #3a81c3; font-weight: bold;">as</span> <span style="color: #ba2f59; font-weight: bold;">HA</span>
<span style="color: #3a81c3; font-weight: bold;">import</span> <span style="color: #ba2f59; font-weight: bold;">Halogen.Component</span> <span style="color: #3a81c3; font-weight: bold;">as</span> <span style="color: #ba2f59; font-weight: bold;">HC</span>

<span style="color: #6c3163; font-weight: bold;">main</span> <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">Eff</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">HA.HalogenEffects</span> <span style="color: #6c3163;">(</span>ajax <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">AJAX</span>, console <span style="color: #715ab1;">::</span> <span style="color: #ba2f59; font-weight: bold;">CONSOLE</span><span style="color: #6c3163;">)</span><span style="color: #3a81c3;">)</span> <span style="color: #ba2f59; font-weight: bold;">Unit</span>
<span style="color: #6c3163; font-weight: bold;">main</span> <span style="color: #715ab1;">=</span> <span style="color: #ba2f59; font-weight: bold;">HA</span><span style="color: #715ab1;">.</span>runHalogenAff <span style="color: #3a81c3; font-weight: bold;">do</span>
  body <span style="color: #715ab1;">&lt;-</span> <span style="color: #ba2f59; font-weight: bold;">HA</span><span style="color: #715ab1;">.</span>awaitBody
  runUI <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">HC</span><span style="color: #715ab1;">.</span>hoist runEffects <span style="color: #ba2f59; font-weight: bold;">Page</span><span style="color: #715ab1;">.</span>component<span style="color: #3a81c3;">)</span> unit body
</pre>
</div>
</div>
</div>
