blog/purescript-en.org
*** Effectful Component Initialization

A component might need to be created with some long-lived information, say from
our server. Making that request requires an Effect, but when and how should that
Effect be performed? The answer is to use a "lifecycle component":

#+BEGIN_SRC purescript
  data Query a = ... | Initialize a

  -- `lifecycleParentComponent` also exists.
  component :: forall e. H.Component HH.HTML Query Unit Void (Effects e)
  component = H.lifecycleComponent { initialState: const state
                                   , render
                                   , eval
                                   , receiver: const Nothing
                                   , initializer: Just $ Initialize unit
                                   , finalizer: Nothing }
    where state = ...

  eval :: forall e. Query ~> H.ComponentDSL State Query Void (Effects e)
  eval = case _ of
    ...  -- cases for other query terms.
    Initialize next -> do
      _ <- HQ.fork do
        posts <- H.lift getPosts
        H.modify (_ { posts = posts })
      pure next
#+END_SRC

It's important to ~fork~ this initial request, or else our component won't
render for the first time until the request is complete.

