blog/purescript-en.html

<div id="outline-container-org8d04e2a" class="outline-4">
<h4 id="org8d04e2a"><span class="section-number-4">2.3.3</span> Effectful Component Initialization</h4>
<div class="outline-text-4" id="text-2-3-3">
<p>
A component might need to be created with some long-lived information, say from
our server. Making that request requires an Effect, but when and how should that
Effect be performed? The answer is to use a "lifecycle component":
</p>

<div class="org-src-container">
<pre class="src src-purescript"><span style="color: #3a81c3; font-weight: bold;">data</span> <span style="color: #ba2f59; font-weight: bold;">Query</span> a <span style="color: #715ab1;">=</span> <span style="color: #715ab1;">...</span> <span style="color: #715ab1;">|</span> <span style="color: #ba2f59; font-weight: bold;">Initialize</span> a

<span style="color: #2aa1ae; background-color: #ecf3ec;">-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">`lifecycleParentComponent` also exists.</span>
<span style="color: #6c3163; font-weight: bold;">component</span> <span style="color: #715ab1;">::</span> forall e<span style="color: #715ab1;">.</span> <span style="color: #ba2f59; font-weight: bold;">H.Component</span> <span style="color: #ba2f59; font-weight: bold;">HH.HTML</span> <span style="color: #ba2f59; font-weight: bold;">Query</span> <span style="color: #ba2f59; font-weight: bold;">Unit</span> <span style="color: #ba2f59; font-weight: bold;">Void</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Effects</span> e<span style="color: #3a81c3;">)</span>
<span style="color: #6c3163; font-weight: bold;">component</span> <span style="color: #715ab1;">=</span> <span style="color: #ba2f59; font-weight: bold;">H</span><span style="color: #715ab1;">.</span>lifecycleComponent <span style="color: #3a81c3;">{</span> initialState<span style="color: #ba2f59; font-weight: bold;">:</span> const state
                                 , render
                                 , eval
                                 , receiver<span style="color: #ba2f59; font-weight: bold;">:</span> const <span style="color: #ba2f59; font-weight: bold;">Nothing</span>
                                 , initializer<span style="color: #ba2f59; font-weight: bold;">:</span> <span style="color: #ba2f59; font-weight: bold;">Just</span> <span style="color: #715ab1;">$</span> <span style="color: #ba2f59; font-weight: bold;">Initialize</span> unit
                                 , finalizer<span style="color: #ba2f59; font-weight: bold;">:</span> <span style="color: #ba2f59; font-weight: bold;">Nothing</span> <span style="color: #3a81c3;">}</span>
  <span style="color: #3a81c3; font-weight: bold;">where</span> state <span style="color: #715ab1;">=</span> <span style="color: #715ab1;">...</span>

<span style="color: #6c3163; font-weight: bold;">eval</span> <span style="color: #715ab1;">::</span> forall e<span style="color: #715ab1;">.</span> <span style="color: #ba2f59; font-weight: bold;">Query</span> <span style="color: #715ab1;">~&gt;</span> <span style="color: #ba2f59; font-weight: bold;">H.ComponentDSL</span> <span style="color: #ba2f59; font-weight: bold;">State</span> <span style="color: #ba2f59; font-weight: bold;">Query</span> <span style="color: #ba2f59; font-weight: bold;">Void</span> <span style="color: #3a81c3;">(</span><span style="color: #ba2f59; font-weight: bold;">Effects</span> e<span style="color: #3a81c3;">)</span>
<span style="color: #6c3163; font-weight: bold;">eval</span> <span style="color: #715ab1;">=</span> <span style="color: #3a81c3; font-weight: bold;">case</span> <span style="color: #3a81c3; font-weight: bold;">_</span> <span style="color: #3a81c3; font-weight: bold;">of</span>
  <span style="color: #715ab1;">...</span>  <span style="color: #2aa1ae; background-color: #ecf3ec;">-- </span><span style="color: #2aa1ae; background-color: #ecf3ec;">cases for other query terms.</span>
  <span style="color: #ba2f59; font-weight: bold;">Initialize</span> next <span style="color: #715ab1;">-&gt;</span> <span style="color: #3a81c3; font-weight: bold;">do</span>
    <span style="color: #3a81c3; font-weight: bold;">_</span> <span style="color: #715ab1;">&lt;-</span> <span style="color: #ba2f59; font-weight: bold;">HQ</span><span style="color: #715ab1;">.</span>fork <span style="color: #3a81c3; font-weight: bold;">do</span>
      posts <span style="color: #715ab1;">&lt;-</span> <span style="color: #ba2f59; font-weight: bold;">H</span><span style="color: #715ab1;">.</span>lift getPosts
      <span style="color: #ba2f59; font-weight: bold;">H</span><span style="color: #715ab1;">.</span>modify <span style="color: #3a81c3;">(</span><span style="color: #3a81c3; font-weight: bold;">_</span> <span style="color: #6c3163;">{</span> posts <span style="color: #715ab1;">=</span> posts <span style="color: #6c3163;">}</span><span style="color: #3a81c3;">)</span>
    pure next
</pre>
</div>

<p>
It's important to <code>fork</code> this initial request, or else our component won't
render for the first time until the request is complete.
</p>
</div>
</div>
