blog/purescript-en.org
*** Requesting and Injecting HTML

For technical reasons, the HTML of these blog posts only exists at runtime.
When you select a post to read on the /Blog/ page, you might notice in your
~Network~ tab that only a single XHR is made to the backend to fetch the
content (i.e. the whole page isn't reloaded). Accomplishing this required
the ~affjax~, ~domparser~ and ~dom-classy~ libraries, along with the following
custom code:

#+BEGIN_SRC purescript
  -- | Make a request for blog post content.
  xhr :: forall e. String -> Aff ( ajax :: AJAX, dom :: DOM | e ) (Array Node)
  xhr p = do
    res <- get $ "/blog/" <> p
    liftEff do
      parser <- newDOMParser
      let doc = parseHTMLFromString res.response parser
      body <- lastChild doc >>= (map join <<< traverse lastChild)
      maybe (pure []) children body

  replaceChildren :: forall e n m. IsNode n => IsNode m => n -> Array m -> Eff ( dom :: DOM | e ) Unit
  replaceChildren el news = removeChildren el *> traverse_ (\n -> appendChild n el) news

  removeChildren :: forall n e. IsNode n => n -> Eff ( dom :: DOM | e ) Unit
  removeChildren el = children el >>= traverse_ (\n -> removeChild n el)

  children :: forall n e. IsNode n => n -> Eff ( dom :: DOM | e ) (Array Node)
  children el = do
    kids <- childNodes el
    len  <- length kids
    let ixs = range 0 (len - 1)
    catMaybes <$> traverse (\i -> item i kids) ixs
#+END_SRC

Now we have the tools in-hand to manipulate the DOM outside the purview of Halogen.
To inject our content, we need a placeholder ~<div>~:

#+BEGIN_SRC purescript
  post :: forall c q. HH.HTML c q
  post = HH.div [ HP.ref (H.RefLabel "blogpost") ] []
#+END_SRC

~post~ would be part of the greater HTML tree defined in ~render~. The important
part is the ~RefLabel~. We can update its actual contents in our ~eval~ function:

#+BEGIN_SRC purescript
  eval :: forall e. Query ~> H.ComponentDSL State Query Void (Effects e)
  eval = case _ of
    ...  -- other cases
    Selected s next -> do
      curr <- H.gets _.selected
      unless (s == curr) $ do
        H.modify (_ { selected = s })
        htmls <- H.getHTMLElementRef (H.RefLabel "blogpost")
        traverse_ (\el -> liftAff (xhr s) >>= liftEff <<< replaceChildren el) htmls
      pure next
#+END_SRC
